<details>
<summary>tf plan</summary>

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.cluster_autoscaler will be destroyed
  - resource "aws_iam_policy" "cluster_autoscaler" {
      - arn    = "arn:aws:iam::774051255656:policy/lead-cluster-autoscaler" -> null
      - id     = "arn:aws:iam::774051255656:policy/lead-cluster-autoscaler" -> null
      - name   = "lead-cluster-autoscaler" -> null
      - path   = "/" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeLaunchTemplateVersions",
                          - "autoscaling:DescribeTags",
                          - "autoscaling:DescribeLaunchConfigurations",
                          - "autoscaling:DescribeAutoScalingInstances",
                          - "autoscaling:DescribeAutoScalingGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "eksWorkerAutoscalingAll"
                    },
                  - {
                      - Action    = [
                          - "autoscaling:UpdateAutoScalingGroup",
                          - "autoscaling:TerminateInstanceInAutoScalingGroup",
                          - "autoscaling:SetDesiredCapacity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled = "true"
                              - autoscaling:ResourceTag/kubernetes.io/cluster/lead        = "owned"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "eksWorkerAutoscalingOwn"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_iam_role_policy_attachment.cluster_autoscaler must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      ~ id         = "lead_cluster_autoscaler_service_account-20191031235701574000000011" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::774051255656:policy/lead-cluster-autoscaler" -> "arn:aws:iam::774051255656:policy/eks-worker-autoscaling-lead20191031235654900500000002" # forces replacement
        role       = "lead_cluster_autoscaler_service_account"
    }

  # module.eks.data.aws_iam_policy_document.worker_autoscaling will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "worker_autoscaling"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeLaunchConfigurations",
              + "autoscaling:DescribeTags",
              + "ec2:DescribeLaunchTemplateVersions",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "eksWorkerAutoscalingAll"
        }
      + statement {
          + actions   = [
              + "autoscaling:SetDesiredCapacity",
              + "autoscaling:TerminateInstanceInAutoScalingGroup",
              + "autoscaling:UpdateAutoScalingGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "eksWorkerAutoscalingOwn"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "autoscaling:ResourceTag/kubernetes.io/cluster/lead"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "true",
                ]
              + variable = "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled"
            }
        }
    }

  # module.eks.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "apiVersion: v1\npreferences: {}\nkind: Config\n\nclusters:\n- cluster:\n    server: ${endpoint}\n    certificate-authority-data: ${cluster_auth_base64}\n  name: ${kubeconfig_name}\n\ncontexts:\n- context:\n    cluster: ${kubeconfig_name}\n    user: ${kubeconfig_name}\n  name: ${kubeconfig_name}\n\ncurrent-context: ${kubeconfig_name}\n\nusers:\n- name: ${kubeconfig_name}\n  user:\n    exec:\n      apiVersion: client.authentication.k8s.io/v1alpha1\n      command: ${aws_authenticator_command}\n      args:\n${aws_authenticator_command_args}\n${aws_authenticator_additional_args}\n${aws_authenticator_env_variables}\n"
      + vars     = {
          + "aws_authenticator_additional_args" = ""
          + "aws_authenticator_command"         = "aws-iam-authenticator"
          + "aws_authenticator_command_args"    = "        - \"token\"\n        - \"-i\"\n        - \"lead\""
          + "aws_authenticator_env_variables"   = ""
          + "cluster_auth_base64"               = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + "endpoint"                          = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          + "kubeconfig_name"                   = "eks_lead"
        }
    }

  # module.eks.data.template_file.launch_template_userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "#!/bin/bash -xe\n\n# Allow user supplied pre userdata code\n${pre_userdata}\n\n# Bootstrap and join the cluster\n/etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args \"${kubelet_extra_args}\" '${cluster_name}'\n\n# Allow user supplied userdata code\n${additional_userdata}\n"
      + vars     = {
          + "additional_userdata"  = ""
          + "bootstrap_extra_args" = "--enable-docker-bridge 'true'"
          + "cluster_auth_base64"  = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + "cluster_name"         = "lead"
          + "endpoint"             = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          + "kubelet_extra_args"   = "--node-labels=kubernetes.io/lifecycle=preemptible"
          + "platform"             = "linux"
          + "pre_userdata"         = "yum install -y amazon-ssm-agent\nsystemctl start amazon-ssm-agent\nsystemctl enable amazon-ssm-agent\n"
        }
    }

  # module.eks.data.template_file.launch_template_userdata[1] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "#!/bin/bash -xe\n\n# Allow user supplied pre userdata code\n${pre_userdata}\n\n# Bootstrap and join the cluster\n/etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args \"${kubelet_extra_args}\" '${cluster_name}'\n\n# Allow user supplied userdata code\n${additional_userdata}\n"
      + vars     = {
          + "additional_userdata"  = ""
          + "bootstrap_extra_args" = "--enable-docker-bridge 'true'"
          + "cluster_auth_base64"  = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + "cluster_name"         = "lead"
          + "endpoint"             = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          + "kubelet_extra_args"   = "--node-labels=kubernetes.io/lifecycle=preemptible"
          + "platform"             = "linux"
          + "pre_userdata"         = "yum install -y amazon-ssm-agent\nsystemctl start amazon-ssm-agent\nsystemctl enable amazon-ssm-agent\n"
        }
    }

  # module.eks.data.template_file.launch_template_userdata[2] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "launch_template_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "#!/bin/bash -xe\n\n# Allow user supplied pre userdata code\n${pre_userdata}\n\n# Bootstrap and join the cluster\n/etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args \"${kubelet_extra_args}\" '${cluster_name}'\n\n# Allow user supplied userdata code\n${additional_userdata}\n"
      + vars     = {
          + "additional_userdata"  = ""
          + "bootstrap_extra_args" = "--enable-docker-bridge 'true'"
          + "cluster_auth_base64"  = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + "cluster_name"         = "lead"
          + "endpoint"             = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          + "kubelet_extra_args"   = "--node-labels=kubernetes.io/lifecycle=preemptible"
          + "platform"             = "linux"
          + "pre_userdata"         = "yum install -y amazon-ssm-agent\nsystemctl start amazon-ssm-agent\nsystemctl enable amazon-ssm-agent\n"
        }
    }

  # module.eks.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "#!/bin/bash -xe\n\n# Allow user supplied pre userdata code\n${pre_userdata}\n\n# Bootstrap and join the cluster\n/etc/eks/bootstrap.sh --b64-cluster-ca '${cluster_auth_base64}' --apiserver-endpoint '${endpoint}' ${bootstrap_extra_args} --kubelet-extra-args \"${kubelet_extra_args}\" '${cluster_name}'\n\n# Allow user supplied userdata code\n${additional_userdata}\n"
      + vars     = {
          + "additional_userdata"  = ""
          + "bootstrap_extra_args" = "--enable-docker-bridge 'true'"
          + "cluster_auth_base64"  = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + "cluster_name"         = "lead"
          + "endpoint"             = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          + "kubelet_extra_args"   = "--node-labels=kubernetes.io/lifecycle=essential --register-with-taints=EssentialOnly=true:NoSchedule"
          + "platform"             = "linux"
          + "pre_userdata"         = "yum install -y amazon-ssm-agent\nsystemctl start amazon-ssm-agent\nsystemctl enable amazon-ssm-agent\n"
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:774051255656:autoScalingGroup:bbe0c284-e2e2-4902-ae50-b5abc8fe6a9b:autoScalingGroupName/lead-essential0-summary-hagfish20191101000448841200000001" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 1
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "lead-essential0-summary-hagfish20191101000448841200000001" -> (known after apply)
      ~ launch_configuration      = "lead-essential02019103123570822260000001f" -> (known after apply)
      ~ load_balancers            = [] -> (known after apply)
      ~ max_size                  = 15 -> 5
        metrics_granularity       = "1Minute"
        min_size                  = 1
      ~ name                      = "lead-essential0-summary-hagfish20191101000448841200000001" -> (known after apply)
      ~ name_prefix               = "lead-essential0-summary-hagfish" -> (known after apply) # forces replacement
        protect_from_scale_in     = true
      ~ service_linked_role_arn   = "arn:aws:iam::774051255656:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
        suspended_processes       = [
            "AZRebalance",
        ]
        tags                      = [
            {
                "key"                 = "Name"
                "propagate_at_launch" = "true"
                "value"               = "lead-essential0-eks_asg"
            },
            {
                "key"                 = "kubernetes.io/cluster/lead"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "k8s.io/cluster/lead"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/enabled"
                "propagate_at_launch" = "false"
                "value"               = "true"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/lead"
                "propagate_at_launch" = "false"
                "value"               = "lead"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/node-template/resources/ephemeral-storage"
                "propagate_at_launch" = "false"
                "value"               = "100Gi"
            },
            {
                "key"                 = "Cluster"
                "propagate_at_launch" = "true"
                "value"               = "lead"
            },
        ]
      ~ target_group_arns         = [] -> (known after apply)
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-00150b73fc51545d3",
            "subnet-082646d7a3b6a1717",
            "subnet-0d62f96e6c6746bc3",
        ]
        wait_for_capacity_timeout = "10m"
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[0] must be replaced
+/- resource "aws_autoscaling_group" "workers_launch_template" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:774051255656:autoScalingGroup:2ba5f7e5-ee95-4eb7-a840-38e21c16b582:autoScalingGroupName/lead-preemptible0-teaching-termite20191101000448843500000003" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 1
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "lead-preemptible0-teaching-termite20191101000448843500000003" -> (known after apply)
      ~ load_balancers            = [] -> (known after apply)
        max_size                  = 5
        metrics_granularity       = "1Minute"
        min_size                  = 1
      ~ name                      = "lead-preemptible0-teaching-termite20191101000448843500000003" -> (known after apply)
      ~ name_prefix               = "lead-preemptible0-teaching-termite" -> (known after apply) # forces replacement
        protect_from_scale_in     = true
      ~ service_linked_role_arn   = "arn:aws:iam::774051255656:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
        suspended_processes       = [
            "AZRebalance",
        ]
        tags                      = [
            {
                "key"                 = "Name"
                "propagate_at_launch" = "true"
                "value"               = "lead-preemptible0-eks_asg"
            },
            {
                "key"                 = "kubernetes.io/cluster/lead"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/enabled"
                "propagate_at_launch" = "false"
                "value"               = "true"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/lead"
                "propagate_at_launch" = "false"
                "value"               = "lead"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/node-template/resources/ephemeral-storage"
                "propagate_at_launch" = "false"
                "value"               = "100Gi"
            },
            {
                "key"                 = "Cluster"
                "propagate_at_launch" = "true"
                "value"               = "lead"
            },
        ]
      ~ target_group_arns         = [] -> (known after apply)
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-00150b73fc51545d3",
        ]
        wait_for_capacity_timeout = "10m"

      ~ mixed_instances_policy {
            instances_distribution {
                on_demand_allocation_strategy            = "prioritized"
                on_demand_base_capacity                  = 0
                on_demand_percentage_above_base_capacity = 0
                spot_allocation_strategy                 = "lowest-price"
                spot_instance_pools                      = 10
            }

          ~ launch_template {
              ~ launch_template_specification {
                    launch_template_id   = "lt-04396ca1876adc41d"
                  ~ launch_template_name = "lead-preemptible020191031235705337900000018" -> (known after apply)
                    version              = "$Latest"
                }

                override {
                    instance_type = "m5.large"
                }
                override {
                    instance_type = "c5.large"
                }
                override {
                    instance_type = "m4.large"
                }
                override {
                    instance_type = "c4.large"
                }
                override {
                    instance_type = "t3.large"
                }
                override {
                    instance_type = "r5.large"
                }
            }
        }
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[1] must be replaced
+/- resource "aws_autoscaling_group" "workers_launch_template" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:774051255656:autoScalingGroup:f7b6356f-b75d-4747-b87e-4894a34b117a:autoScalingGroupName/lead-preemptible1-smooth-hedgehog20191101000448843000000002" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1b",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 1
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "lead-preemptible1-smooth-hedgehog20191101000448843000000002" -> (known after apply)
      ~ load_balancers            = [] -> (known after apply)
        max_size                  = 5
        metrics_granularity       = "1Minute"
        min_size                  = 1
      ~ name                      = "lead-preemptible1-smooth-hedgehog20191101000448843000000002" -> (known after apply)
      ~ name_prefix               = "lead-preemptible1-smooth-hedgehog" -> (known after apply) # forces replacement
        protect_from_scale_in     = true
      ~ service_linked_role_arn   = "arn:aws:iam::774051255656:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
        suspended_processes       = [
            "AZRebalance",
        ]
        tags                      = [
            {
                "key"                 = "Name"
                "propagate_at_launch" = "true"
                "value"               = "lead-preemptible1-eks_asg"
            },
            {
                "key"                 = "kubernetes.io/cluster/lead"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/enabled"
                "propagate_at_launch" = "false"
                "value"               = "true"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/lead"
                "propagate_at_launch" = "false"
                "value"               = "lead"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/node-template/resources/ephemeral-storage"
                "propagate_at_launch" = "false"
                "value"               = "100Gi"
            },
            {
                "key"                 = "Cluster"
                "propagate_at_launch" = "true"
                "value"               = "lead"
            },
        ]
      ~ target_group_arns         = [] -> (known after apply)
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-082646d7a3b6a1717",
        ]
        wait_for_capacity_timeout = "10m"

      ~ mixed_instances_policy {
            instances_distribution {
                on_demand_allocation_strategy            = "prioritized"
                on_demand_base_capacity                  = 0
                on_demand_percentage_above_base_capacity = 0
                spot_allocation_strategy                 = "lowest-price"
                spot_instance_pools                      = 10
            }

          ~ launch_template {
              ~ launch_template_specification {
                    launch_template_id   = "lt-0d7991926151778f5"
                  ~ launch_template_name = "lead-preemptible12019103123570551910000001b" -> (known after apply)
                    version              = "$Latest"
                }

                override {
                    instance_type = "m5.large"
                }
                override {
                    instance_type = "c5.large"
                }
                override {
                    instance_type = "m4.large"
                }
                override {
                    instance_type = "c4.large"
                }
                override {
                    instance_type = "t3.large"
                }
                override {
                    instance_type = "r5.large"
                }
            }
        }
    }

  # module.eks.aws_autoscaling_group.workers_launch_template[2] must be replaced
+/- resource "aws_autoscaling_group" "workers_launch_template" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:774051255656:autoScalingGroup:44970be3-bf93-4359-91b1-7f8f366a38a7:autoScalingGroupName/lead-preemptible2-upright-redfish20191101000448843600000004" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
        desired_capacity          = 1
        enabled_metrics           = [
            "GroupDesiredCapacity",
            "GroupInServiceInstances",
            "GroupMaxSize",
            "GroupMinSize",
            "GroupPendingInstances",
            "GroupStandbyInstances",
            "GroupTerminatingInstances",
            "GroupTotalInstances",
        ]
        force_delete              = false
        health_check_grace_period = 300
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "lead-preemptible2-upright-redfish20191101000448843600000004" -> (known after apply)
      ~ load_balancers            = [] -> (known after apply)
        max_size                  = 5
        metrics_granularity       = "1Minute"
        min_size                  = 1
      ~ name                      = "lead-preemptible2-upright-redfish20191101000448843600000004" -> (known after apply)
      ~ name_prefix               = "lead-preemptible2-upright-redfish" -> (known after apply) # forces replacement
        protect_from_scale_in     = true
      ~ service_linked_role_arn   = "arn:aws:iam::774051255656:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
        suspended_processes       = [
            "AZRebalance",
        ]
        tags                      = [
            {
                "key"                 = "Name"
                "propagate_at_launch" = "true"
                "value"               = "lead-preemptible2-eks_asg"
            },
            {
                "key"                 = "kubernetes.io/cluster/lead"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/enabled"
                "propagate_at_launch" = "false"
                "value"               = "true"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/lead"
                "propagate_at_launch" = "false"
                "value"               = "lead"
            },
            {
                "key"                 = "k8s.io/cluster-autoscaler/node-template/resources/ephemeral-storage"
                "propagate_at_launch" = "false"
                "value"               = "100Gi"
            },
            {
                "key"                 = "Cluster"
                "propagate_at_launch" = "true"
                "value"               = "lead"
            },
        ]
      ~ target_group_arns         = [] -> (known after apply)
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-0d62f96e6c6746bc3",
        ]
        wait_for_capacity_timeout = "10m"

      ~ mixed_instances_policy {
            instances_distribution {
                on_demand_allocation_strategy            = "prioritized"
                on_demand_base_capacity                  = 0
                on_demand_percentage_above_base_capacity = 0
                spot_allocation_strategy                 = "lowest-price"
                spot_instance_pools                      = 10
            }

          ~ launch_template {
              ~ launch_template_specification {
                    launch_template_id   = "lt-0e2826a50c6c430a5"
                  ~ launch_template_name = "lead-preemptible22019103123570576690000001d" -> (known after apply)
                    version              = "$Latest"
                }

                override {
                    instance_type = "m5.large"
                }
                override {
                    instance_type = "c5.large"
                }
                override {
                    instance_type = "m4.large"
                }
                override {
                    instance_type = "c4.large"
                }
                override {
                    instance_type = "t3.large"
                }
                override {
                    instance_type = "r5.large"
                }
            }
        }
    }

  # module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        arn                       = "arn:aws:eks:us-east-1:774051255656:cluster/lead"
        certificate_authority     = [
            {
                data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
            },
        ]
        created_at                = "2019-10-31 23:44:08 +0000 UTC"
        enabled_cluster_log_types = []
        endpoint                  = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
        id                        = "lead"
        identity                  = [
            {
                oidc = [
                    {
                        issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/38375355FB06B23ABA5C492B2ADACEA9"
                    },
                ]
            },
        ]
        name                      = "lead"
        platform_version          = "eks.1"
        role_arn                  = "arn:aws:iam::774051255656:role/lead20191031234357493700000001"
        status                    = "ACTIVE"
      ~ tags                      = {
          + "Cluster" = "lead"
        }
        version                   = "1.14"

        timeouts {
            create = "15m"
            delete = "15m"
        }

        vpc_config {
            endpoint_private_access = false
            endpoint_public_access  = true
            security_group_ids      = [
                "sg-07367b450eb754f9f",
            ]
            subnet_ids              = [
                "subnet-00150b73fc51545d3",
                "subnet-082646d7a3b6a1717",
                "subnet-0d62f96e6c6746bc3",
            ]
            vpc_id                  = "vpc-00072fb768642aad2"
        }
    }

  # module.eks.aws_iam_policy.worker_autoscaling[0] will be updated in-place
  ~ resource "aws_iam_policy" "worker_autoscaling" {
        arn         = "arn:aws:iam::774051255656:policy/eks-worker-autoscaling-lead20191031235654900500000002"
        description = "EKS worker node autoscaling policy for cluster lead"
        id          = "arn:aws:iam::774051255656:policy/eks-worker-autoscaling-lead20191031235654900500000002"
        name        = "eks-worker-autoscaling-lead20191031235654900500000002"
        name_prefix = "eks-worker-autoscaling-lead"
        path        = "/"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeLaunchTemplateVersions",
                          - "autoscaling:DescribeTags",
                          - "autoscaling:DescribeLaunchConfigurations",
                          - "autoscaling:DescribeAutoScalingInstances",
                          - "autoscaling:DescribeAutoScalingGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "eksWorkerAutoscalingAll"
                    },
                  - {
                      - Action    = [
                          - "autoscaling:UpdateAutoScalingGroup",
                          - "autoscaling:TerminateInstanceInAutoScalingGroup",
                          - "autoscaling:SetDesiredCapacity",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled = "true"
                              - autoscaling:ResourceTag/kubernetes.io/cluster/lead        = "owned"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "eksWorkerAutoscalingOwn"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_autoscaling[0] will be destroyed
  - resource "aws_iam_role_policy_attachment" "workers_autoscaling" {
      - id         = "lead20191031235656156200000004-2019103123570058750000000e" -> null
      - policy_arn = "arn:aws:iam::774051255656:policy/eks-worker-autoscaling-lead20191031235654900500000002" -> null
      - role       = "lead20191031235656156200000004" -> null
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
        associate_public_ip_address      = false
        ebs_optimized                    = true
        enable_monitoring                = true
        iam_instance_profile             = "lead20191031235704435700000016"
      ~ id                               = "lead-essential02019103123570822260000001f" -> (known after apply)
        image_id                         = "ami-0392bafc801b7520f"
        instance_type                    = "t3.small"
      + key_name                         = (known after apply)
      ~ name                             = "lead-essential02019103123570822260000001f" -> (known after apply)
        name_prefix                      = "lead-essential0"
        security_groups                  = [
            "sg-09e4402ab92d13a06",
            "sg-0f00eba7c8cb1e7cf",
        ]
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgcHJlIHVzZXJkYXRhIGNvZGUKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCgojIEJvb3RzdHJhcCBhbmQgam9pbiB0aGUgY2x1c3RlcgovZXRjL2Vrcy9ib290c3RyYXAuc2ggLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVTjVSRU5EUVdKRFowRjNTVUpCWjBsQ1FVUkJUa0puYTNGb2EybEhPWGN3UWtGUmMwWkJSRUZXVFZKTmQwVlJXVVJXVVZGRVJYZHdjbVJYU213S1kyMDFiR1JIVm5wTlFqUllSRlJGTlUxVVFYcE5WRWw2VGxSRmVFNUdiMWhFVkVrMVRWUkJlVTlFU1hwT1ZFVjRUa1p2ZDBaVVJWUk5Ra1ZIUVRGVlJRcEJlRTFMWVROV2FWcFlTblZhV0ZKc1kzcERRMEZUU1hkRVVWbEtTMjlhU1doMlkwNUJVVVZDUWxGQlJHZG5SVkJCUkVORFFWRnZRMmRuUlVKQlRuVlVDa0V2TDBGQk1YUnVORWxIUldaTmQwWnVRazVEWnpsMlpsbEtZa2xOU1hkVFJrOTNXRW81VG1zeVdVUlpWbkpMWmxkRFJFTXJWV2xpTTFoS2QyTlZaVzBLUXpWRVppdHBjSFJ5UVdoNVlVUTNjRFY1WVhKeWNqWTNiVGc0VHpZMVJVcE5NV2hNVG1OVlRUWndhM1ZEU21WRU9XaEVUR2xHTmpBeE1qVjVhUzloU2dwTWFWSlFWRzF2UzFWT2VWVTNWbWRxU1RaMVEzTlJiWHBqZEdkaFVqRldPR3RGWmpSbU9ESTJUMnRqVTFOVk4yWjNaMFo0YVhaaFRHVlVSME5uZG5aV0NrNTRXVTVhVjJ4SmVtWmhhMVZyTnpCTVJWQkVaMGN2ZFhSME5VUnFSbmxSVW05NldtTjJOa0pUS3pSdVpIVjNNRTl3WVU1R1prRklOSGhoVlc1Nk1rNEtOa3RSYzI5YVoyWTVNWElyVVhab1YxVkhTRXQ2TjJKM1NIRTJOblozU1c0NVlubDBkMjFoY2pWT01WRndRMEZ2V0V4bFVtd3hWR2RoU3l0VFEwZzBaQXA2VEdwVGNUVkpNSGhRTlVWSGFUUnFOMXBOUTBGM1JVRkJZVTFxVFVORmQwUm5XVVJXVWpCUVFWRklMMEpCVVVSQlowdHJUVUU0UjBFeFZXUkZkMFZDQ2k5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWtGTGRsaHFXRkpPUzIxd2QwRk1UVk5DUms0elYyZFJVbHByVTJzS1VrOWhkMlpPVGpReEsyUlJWR2x2YWtObUwzZFFjQzhyZG5GWlIwTXJjRlJKU2tOQkswSXdOSEZLTDBod01UVTRiVVI2VTBwM01uaFRlRVZTUmpCc05RcFRaVll5Y2t0SU5rTTFaVGM0WkVkQ01FOVdRVkI0Ym5kRWEwbGpiekZsY1cxeFNsQnFSV05tYm5sS1oxRjJhVmRDWWpodE1tcERObUZDU2pFMFptOTBDa3R5WW1oRVFscGphMDlxVVhaMFdYQnJlbGsxV0VodlUxZHdkWEUyVGtkdk1VVXdiVzFQWmt0WlkzTnNkVTVSVG0xb1JEUnNiVTlwVHpBelNXSTRSSGtLZVhKbFRsRmhSVTFxVEd4UGREVlRabXhPVDBOSlJYbFJTMlZ4WkRSamVWbE5NVTFWVVhGd1FYRndOMDVVV2xWclFtdDJhMEo2UXpWV2JYWTRjMFEyVWdwTWFUbFdaV3R2VDFOSU4wNU1PR1Z5VTNoTVV5OUJWemRYVG04dlYwVk1iWGhGWTBwNU1YbEhiWGM0WlRSc0t6RlNWMHhCZG5jd2JrUklORDBLTFMwdExTMUZUa1FnUTBWU1ZFbEdTVU5CVkVVdExTMHRMUW89JyAtLWFwaXNlcnZlci1lbmRwb2ludCAnaHR0cHM6Ly8zODM3NTM1NUZCMDZCMjNBQkE1QzQ5MkIyQURBQ0VBOS5ncjcudXMtZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tJyAtLWVuYWJsZS1kb2NrZXItYnJpZGdlICd0cnVlJyAtLWt1YmVsZXQtZXh0cmEtYXJncyAiLS1ub2RlLWxhYmVscz1rdWJlcm5ldGVzLmlvL2xpZmVjeWNsZT1lc3NlbnRpYWwgLS1yZWdpc3Rlci13aXRoLXRhaW50cz1Fc3NlbnRpYWxPbmx5PXRydWU6Tm9TY2hlZHVsZSIgJ2xlYWQnCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
          ~ encrypted             = false -> (known after apply)
            iops                  = 0
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.eks.aws_launch_template.workers_launch_template[0] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        arn                     = "arn:aws:ec2:us-east-1:774051255656:launch-template/lt-04396ca1876adc41d"
        default_version         = 1
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-04396ca1876adc41d"
        image_id                = "ami-0392bafc801b7520f"
        instance_type           = "m4.large"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "lead-preemptible020191031235705337900000018"
        name_prefix             = "lead-preemptible0"
        security_group_names    = []
        tags                    = {
            "Cluster" = "lead"
        }
      ~ user_data               = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgcHJlIHVzZXJkYXRhIGNvZGUKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCgojIEJvb3RzdHJhcCBhbmQgam9pbiB0aGUgY2x1c3RlcgovZXRjL2Vrcy9ib290c3RyYXAuc2ggLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVTjVSRU5EUVdKRFowRjNTVUpCWjBsQ1FVUkJUa0puYTNGb2EybEhPWGN3UWtGUmMwWkJSRUZXVFZKTmQwVlJXVVJXVVZGRVJYZHdjbVJYU213S1kyMDFiR1JIVm5wTlFqUllSRlJGTlUxVVFYcE5WRWw2VGxSRmVFNUdiMWhFVkVrMVRWUkJlVTlFU1hwT1ZFVjRUa1p2ZDBaVVJWUk5Ra1ZIUVRGVlJRcEJlRTFMWVROV2FWcFlTblZhV0ZKc1kzcERRMEZUU1hkRVVWbEtTMjlhU1doMlkwNUJVVVZDUWxGQlJHZG5SVkJCUkVORFFWRnZRMmRuUlVKQlRuVlVDa0V2TDBGQk1YUnVORWxIUldaTmQwWnVRazVEWnpsMlpsbEtZa2xOU1hkVFJrOTNXRW81VG1zeVdVUlpWbkpMWmxkRFJFTXJWV2xpTTFoS2QyTlZaVzBLUXpWRVppdHBjSFJ5UVdoNVlVUTNjRFY1WVhKeWNqWTNiVGc0VHpZMVJVcE5NV2hNVG1OVlRUWndhM1ZEU21WRU9XaEVUR2xHTmpBeE1qVjVhUzloU2dwTWFWSlFWRzF2UzFWT2VWVTNWbWRxU1RaMVEzTlJiWHBqZEdkaFVqRldPR3RGWmpSbU9ESTJUMnRqVTFOVk4yWjNaMFo0YVhaaFRHVlVSME5uZG5aV0NrNTRXVTVhVjJ4SmVtWmhhMVZyTnpCTVJWQkVaMGN2ZFhSME5VUnFSbmxSVW05NldtTjJOa0pUS3pSdVpIVjNNRTl3WVU1R1prRklOSGhoVlc1Nk1rNEtOa3RSYzI5YVoyWTVNWElyVVhab1YxVkhTRXQ2TjJKM1NIRTJOblozU1c0NVlubDBkMjFoY2pWT01WRndRMEZ2V0V4bFVtd3hWR2RoU3l0VFEwZzBaQXA2VEdwVGNUVkpNSGhRTlVWSGFUUnFOMXBOUTBGM1JVRkJZVTFxVFVORmQwUm5XVVJXVWpCUVFWRklMMEpCVVVSQlowdHJUVUU0UjBFeFZXUkZkMFZDQ2k5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWtGTGRsaHFXRkpPUzIxd2QwRk1UVk5DUms0elYyZFJVbHByVTJzS1VrOWhkMlpPVGpReEsyUlJWR2x2YWtObUwzZFFjQzhyZG5GWlIwTXJjRlJKU2tOQkswSXdOSEZLTDBod01UVTRiVVI2VTBwM01uaFRlRVZTUmpCc05RcFRaVll5Y2t0SU5rTTFaVGM0WkVkQ01FOVdRVkI0Ym5kRWEwbGpiekZsY1cxeFNsQnFSV05tYm5sS1oxRjJhVmRDWWpodE1tcERObUZDU2pFMFptOTBDa3R5WW1oRVFscGphMDlxVVhaMFdYQnJlbGsxV0VodlUxZHdkWEUyVGtkdk1VVXdiVzFQWmt0WlkzTnNkVTVSVG0xb1JEUnNiVTlwVHpBelNXSTRSSGtLZVhKbFRsRmhSVTFxVEd4UGREVlRabXhPVDBOSlJYbFJTMlZ4WkRSamVWbE5NVTFWVVhGd1FYRndOMDVVV2xWclFtdDJhMEo2UXpWV2JYWTRjMFEyVWdwTWFUbFdaV3R2VDFOSU4wNU1PR1Z5VTNoTVV5OUJWemRYVG04dlYwVk1iWGhGWTBwNU1YbEhiWGM0WlRSc0t6RlNWMHhCZG5jd2JrUklORDBLTFMwdExTMUZUa1FnUTBWU1ZFbEdTVU5CVkVVdExTMHRMUW89JyAtLWFwaXNlcnZlci1lbmRwb2ludCAnaHR0cHM6Ly8zODM3NTM1NUZCMDZCMjNBQkE1QzQ5MkIyQURBQ0VBOS5ncjcudXMtZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tJyAtLWVuYWJsZS1kb2NrZXItYnJpZGdlICd0cnVlJyAtLWt1YmVsZXQtZXh0cmEtYXJncyAiLS1ub2RlLWxhYmVscz1rdWJlcm5ldGVzLmlvL2xpZmVjeWNsZT1wcmVlbXB0aWJsZSIgJ2xlYWQnCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply)
        vpc_security_group_ids  = []

        block_device_mappings {
            device_name = "/dev/xvda"

            ebs {
                delete_on_termination = "true"
                iops                  = 0
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        credit_specification {
            cpu_credits = "standard"
        }

        iam_instance_profile {
            name = "lead20191031235702524700000013"
        }

        monitoring {
            enabled = true
        }

        network_interfaces {
            associate_public_ip_address = false
            delete_on_termination       = true
            device_index                = 0
            ipv4_address_count          = 0
            ipv4_addresses              = []
            ipv6_address_count          = 0
            ipv6_addresses              = []
            security_groups             = [
                "sg-09e4402ab92d13a06",
                "sg-0f00eba7c8cb1e7cf",
            ]
        }

        placement {
            tenancy = "default"
        }

        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Cluster" = "lead"
                "Name"    = "lead-preemptible0-eks_asg"
            }
        }
    }

  # module.eks.aws_launch_template.workers_launch_template[1] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        arn                     = "arn:aws:ec2:us-east-1:774051255656:launch-template/lt-0d7991926151778f5"
        default_version         = 1
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-0d7991926151778f5"
        image_id                = "ami-0392bafc801b7520f"
        instance_type           = "m4.large"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "lead-preemptible12019103123570551910000001b"
        name_prefix             = "lead-preemptible1"
        security_group_names    = []
        tags                    = {
            "Cluster" = "lead"
        }
      ~ user_data               = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgcHJlIHVzZXJkYXRhIGNvZGUKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCgojIEJvb3RzdHJhcCBhbmQgam9pbiB0aGUgY2x1c3RlcgovZXRjL2Vrcy9ib290c3RyYXAuc2ggLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVTjVSRU5EUVdKRFowRjNTVUpCWjBsQ1FVUkJUa0puYTNGb2EybEhPWGN3UWtGUmMwWkJSRUZXVFZKTmQwVlJXVVJXVVZGRVJYZHdjbVJYU213S1kyMDFiR1JIVm5wTlFqUllSRlJGTlUxVVFYcE5WRWw2VGxSRmVFNUdiMWhFVkVrMVRWUkJlVTlFU1hwT1ZFVjRUa1p2ZDBaVVJWUk5Ra1ZIUVRGVlJRcEJlRTFMWVROV2FWcFlTblZhV0ZKc1kzcERRMEZUU1hkRVVWbEtTMjlhU1doMlkwNUJVVVZDUWxGQlJHZG5SVkJCUkVORFFWRnZRMmRuUlVKQlRuVlVDa0V2TDBGQk1YUnVORWxIUldaTmQwWnVRazVEWnpsMlpsbEtZa2xOU1hkVFJrOTNXRW81VG1zeVdVUlpWbkpMWmxkRFJFTXJWV2xpTTFoS2QyTlZaVzBLUXpWRVppdHBjSFJ5UVdoNVlVUTNjRFY1WVhKeWNqWTNiVGc0VHpZMVJVcE5NV2hNVG1OVlRUWndhM1ZEU21WRU9XaEVUR2xHTmpBeE1qVjVhUzloU2dwTWFWSlFWRzF2UzFWT2VWVTNWbWRxU1RaMVEzTlJiWHBqZEdkaFVqRldPR3RGWmpSbU9ESTJUMnRqVTFOVk4yWjNaMFo0YVhaaFRHVlVSME5uZG5aV0NrNTRXVTVhVjJ4SmVtWmhhMVZyTnpCTVJWQkVaMGN2ZFhSME5VUnFSbmxSVW05NldtTjJOa0pUS3pSdVpIVjNNRTl3WVU1R1prRklOSGhoVlc1Nk1rNEtOa3RSYzI5YVoyWTVNWElyVVhab1YxVkhTRXQ2TjJKM1NIRTJOblozU1c0NVlubDBkMjFoY2pWT01WRndRMEZ2V0V4bFVtd3hWR2RoU3l0VFEwZzBaQXA2VEdwVGNUVkpNSGhRTlVWSGFUUnFOMXBOUTBGM1JVRkJZVTFxVFVORmQwUm5XVVJXVWpCUVFWRklMMEpCVVVSQlowdHJUVUU0UjBFeFZXUkZkMFZDQ2k5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWtGTGRsaHFXRkpPUzIxd2QwRk1UVk5DUms0elYyZFJVbHByVTJzS1VrOWhkMlpPVGpReEsyUlJWR2x2YWtObUwzZFFjQzhyZG5GWlIwTXJjRlJKU2tOQkswSXdOSEZLTDBod01UVTRiVVI2VTBwM01uaFRlRVZTUmpCc05RcFRaVll5Y2t0SU5rTTFaVGM0WkVkQ01FOVdRVkI0Ym5kRWEwbGpiekZsY1cxeFNsQnFSV05tYm5sS1oxRjJhVmRDWWpodE1tcERObUZDU2pFMFptOTBDa3R5WW1oRVFscGphMDlxVVhaMFdYQnJlbGsxV0VodlUxZHdkWEUyVGtkdk1VVXdiVzFQWmt0WlkzTnNkVTVSVG0xb1JEUnNiVTlwVHpBelNXSTRSSGtLZVhKbFRsRmhSVTFxVEd4UGREVlRabXhPVDBOSlJYbFJTMlZ4WkRSamVWbE5NVTFWVVhGd1FYRndOMDVVV2xWclFtdDJhMEo2UXpWV2JYWTRjMFEyVWdwTWFUbFdaV3R2VDFOSU4wNU1PR1Z5VTNoTVV5OUJWemRYVG04dlYwVk1iWGhGWTBwNU1YbEhiWGM0WlRSc0t6RlNWMHhCZG5jd2JrUklORDBLTFMwdExTMUZUa1FnUTBWU1ZFbEdTVU5CVkVVdExTMHRMUW89JyAtLWFwaXNlcnZlci1lbmRwb2ludCAnaHR0cHM6Ly8zODM3NTM1NUZCMDZCMjNBQkE1QzQ5MkIyQURBQ0VBOS5ncjcudXMtZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tJyAtLWVuYWJsZS1kb2NrZXItYnJpZGdlICd0cnVlJyAtLWt1YmVsZXQtZXh0cmEtYXJncyAiLS1ub2RlLWxhYmVscz1rdWJlcm5ldGVzLmlvL2xpZmVjeWNsZT1wcmVlbXB0aWJsZSIgJ2xlYWQnCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply)
        vpc_security_group_ids  = []

        block_device_mappings {
            device_name = "/dev/xvda"

            ebs {
                delete_on_termination = "true"
                iops                  = 0
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        credit_specification {
            cpu_credits = "standard"
        }

        iam_instance_profile {
            name = "lead20191031235702682000000014"
        }

        monitoring {
            enabled = true
        }

        network_interfaces {
            associate_public_ip_address = false
            delete_on_termination       = true
            device_index                = 0
            ipv4_address_count          = 0
            ipv4_addresses              = []
            ipv6_address_count          = 0
            ipv6_addresses              = []
            security_groups             = [
                "sg-09e4402ab92d13a06",
                "sg-0f00eba7c8cb1e7cf",
            ]
        }

        placement {
            tenancy = "default"
        }

        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Cluster" = "lead"
                "Name"    = "lead-preemptible1-eks_asg"
            }
        }
    }

  # module.eks.aws_launch_template.workers_launch_template[2] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        arn                     = "arn:aws:ec2:us-east-1:774051255656:launch-template/lt-0e2826a50c6c430a5"
        default_version         = 1
        disable_api_termination = false
        ebs_optimized           = "true"
        id                      = "lt-0e2826a50c6c430a5"
        image_id                = "ami-0392bafc801b7520f"
        instance_type           = "m4.large"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "lead-preemptible22019103123570576690000001d"
        name_prefix             = "lead-preemptible2"
        security_group_names    = []
        tags                    = {
            "Cluster" = "lead"
        }
      ~ user_data               = "IyEvYmluL2Jhc2ggLXhlCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgcHJlIHVzZXJkYXRhIGNvZGUKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCgojIEJvb3RzdHJhcCBhbmQgam9pbiB0aGUgY2x1c3RlcgovZXRjL2Vrcy9ib290c3RyYXAuc2ggLS1iNjQtY2x1c3Rlci1jYSAnTFMwdExTMUNSVWRKVGlCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2sxSlNVTjVSRU5EUVdKRFowRjNTVUpCWjBsQ1FVUkJUa0puYTNGb2EybEhPWGN3UWtGUmMwWkJSRUZXVFZKTmQwVlJXVVJXVVZGRVJYZHdjbVJYU213S1kyMDFiR1JIVm5wTlFqUllSRlJGTlUxVVFYcE5WRWw2VGxSRmVFNUdiMWhFVkVrMVRWUkJlVTlFU1hwT1ZFVjRUa1p2ZDBaVVJWUk5Ra1ZIUVRGVlJRcEJlRTFMWVROV2FWcFlTblZhV0ZKc1kzcERRMEZUU1hkRVVWbEtTMjlhU1doMlkwNUJVVVZDUWxGQlJHZG5SVkJCUkVORFFWRnZRMmRuUlVKQlRuVlVDa0V2TDBGQk1YUnVORWxIUldaTmQwWnVRazVEWnpsMlpsbEtZa2xOU1hkVFJrOTNXRW81VG1zeVdVUlpWbkpMWmxkRFJFTXJWV2xpTTFoS2QyTlZaVzBLUXpWRVppdHBjSFJ5UVdoNVlVUTNjRFY1WVhKeWNqWTNiVGc0VHpZMVJVcE5NV2hNVG1OVlRUWndhM1ZEU21WRU9XaEVUR2xHTmpBeE1qVjVhUzloU2dwTWFWSlFWRzF2UzFWT2VWVTNWbWRxU1RaMVEzTlJiWHBqZEdkaFVqRldPR3RGWmpSbU9ESTJUMnRqVTFOVk4yWjNaMFo0YVhaaFRHVlVSME5uZG5aV0NrNTRXVTVhVjJ4SmVtWmhhMVZyTnpCTVJWQkVaMGN2ZFhSME5VUnFSbmxSVW05NldtTjJOa0pUS3pSdVpIVjNNRTl3WVU1R1prRklOSGhoVlc1Nk1rNEtOa3RSYzI5YVoyWTVNWElyVVhab1YxVkhTRXQ2TjJKM1NIRTJOblozU1c0NVlubDBkMjFoY2pWT01WRndRMEZ2V0V4bFVtd3hWR2RoU3l0VFEwZzBaQXA2VEdwVGNUVkpNSGhRTlVWSGFUUnFOMXBOUTBGM1JVRkJZVTFxVFVORmQwUm5XVVJXVWpCUVFWRklMMEpCVVVSQlowdHJUVUU0UjBFeFZXUkZkMFZDQ2k5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWtGTGRsaHFXRkpPUzIxd2QwRk1UVk5DUms0elYyZFJVbHByVTJzS1VrOWhkMlpPVGpReEsyUlJWR2x2YWtObUwzZFFjQzhyZG5GWlIwTXJjRlJKU2tOQkswSXdOSEZLTDBod01UVTRiVVI2VTBwM01uaFRlRVZTUmpCc05RcFRaVll5Y2t0SU5rTTFaVGM0WkVkQ01FOVdRVkI0Ym5kRWEwbGpiekZsY1cxeFNsQnFSV05tYm5sS1oxRjJhVmRDWWpodE1tcERObUZDU2pFMFptOTBDa3R5WW1oRVFscGphMDlxVVhaMFdYQnJlbGsxV0VodlUxZHdkWEUyVGtkdk1VVXdiVzFQWmt0WlkzTnNkVTVSVG0xb1JEUnNiVTlwVHpBelNXSTRSSGtLZVhKbFRsRmhSVTFxVEd4UGREVlRabXhPVDBOSlJYbFJTMlZ4WkRSamVWbE5NVTFWVVhGd1FYRndOMDVVV2xWclFtdDJhMEo2UXpWV2JYWTRjMFEyVWdwTWFUbFdaV3R2VDFOSU4wNU1PR1Z5VTNoTVV5OUJWemRYVG04dlYwVk1iWGhGWTBwNU1YbEhiWGM0WlRSc0t6RlNWMHhCZG5jd2JrUklORDBLTFMwdExTMUZUa1FnUTBWU1ZFbEdTVU5CVkVVdExTMHRMUW89JyAtLWFwaXNlcnZlci1lbmRwb2ludCAnaHR0cHM6Ly8zODM3NTM1NUZCMDZCMjNBQkE1QzQ5MkIyQURBQ0VBOS5ncjcudXMtZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tJyAtLWVuYWJsZS1kb2NrZXItYnJpZGdlICd0cnVlJyAtLWt1YmVsZXQtZXh0cmEtYXJncyAiLS1ub2RlLWxhYmVscz1rdWJlcm5ldGVzLmlvL2xpZmVjeWNsZT1wcmVlbXB0aWJsZSIgJ2xlYWQnCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQoK" -> (known after apply)
        vpc_security_group_ids  = []

        block_device_mappings {
            device_name = "/dev/xvda"

            ebs {
                delete_on_termination = "true"
                iops                  = 0
                volume_size           = 100
                volume_type           = "gp2"
            }
        }

        credit_specification {
            cpu_credits = "standard"
        }

        iam_instance_profile {
            name = "lead20191031235702800400000015"
        }

        monitoring {
            enabled = true
        }

        network_interfaces {
            associate_public_ip_address = false
            delete_on_termination       = true
            device_index                = 0
            ipv4_address_count          = 0
            ipv4_addresses              = []
            ipv6_address_count          = 0
            ipv6_addresses              = []
            security_groups             = [
                "sg-09e4402ab92d13a06",
                "sg-0f00eba7c8cb1e7cf",
            ]
        }

        placement {
            tenancy = "default"
        }

        tag_specifications {
            resource_type = "volume"
            tags          = {
                "Cluster" = "lead"
                "Name"    = "lead-preemptible2-eks_asg"
            }
        }
    }

  # module.eks.local_file.config_map_aws_auth[0] will be created
  + resource "local_file" "config_map_aws_auth" {
      + content              = "apiVersion: v1\nkind: ConfigMap\nmetadata:\n  name: aws-auth\n  namespace: kube-system\ndata:\n  mapRoles: |\n    - rolearn: arn:aws:iam::774051255656:role/lead20191031235656156200000004\n      username: system:node:{{EC2PrivateDNSName}}\n      groups:\n        - system:bootstrappers\n        - system:nodes\n\n  \n    - \"groups\":\n      - \"system:masters\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/Administrator\"\n      \"username\": \"administrator\"\n    - \"groups\":\n      - \"system:masters\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/Developer\"\n      \"username\": \"developer\"\n    - \"groups\":\n      - \"system:authenticated\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/lead_workspace_role\"\n      \"username\": \"user\"\n    \n  \n  \n  \n"
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config-map-aws-auth_lead.yaml"
      + id                   = (known after apply)
    }

  # module.eks.null_resource.update_config_map_aws_auth[0] must be replaced
-/+ resource "null_resource" "update_config_map_aws_auth" {
      ~ id       = "8840686797755962625" -> (known after apply)
      ~ triggers = {
          - "config_map_rendered"      = "apiVersion: v1\nkind: ConfigMap\nmetadata:\n  name: aws-auth\n  namespace: kube-system\ndata:\n  mapRoles: |\n    - rolearn: arn:aws:iam::774051255656:role/lead20191031235656156200000004\n      username: system:node:{{EC2PrivateDNSName}}\n      groups:\n        - system:bootstrappers\n        - system:nodes\n\n  \n    - \"groups\":\n      - \"system:masters\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/Administrator\"\n      \"username\": \"administrator\"\n    - \"groups\":\n      - \"system:masters\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/Developer\"\n      \"username\": \"developer\"\n    - \"groups\":\n      - \"system:authenticated\"\n      \"rolearn\": \"arn:aws:iam::774051255656:role/lead_workspace_role\"\n      \"username\": \"user\"\n    \n  \n  \n  \n"
          - "endpoint"                 = "https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com"
          - "kube_config_map_rendered" = "apiVersion: v1\npreferences: {}\nkind: Config\n\nclusters:\n- cluster:\n    server: https://38375355FB06B23ABA5C492B2ADACEA9.gr7.us-east-1.eks.amazonaws.com\n    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRFNU1UQXpNVEl6TlRFeE5Gb1hEVEk1TVRBeU9ESXpOVEV4TkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTnVUCkEvL0FBMXRuNElHRWZNd0ZuQk5DZzl2ZllKYklNSXdTRk93WEo5TmsyWURZVnJLZldDREMrVWliM1hKd2NVZW0KQzVEZitpcHRyQWh5YUQ3cDV5YXJycjY3bTg4TzY1RUpNMWhMTmNVTTZwa3VDSmVEOWhETGlGNjAxMjV5aS9hSgpMaVJQVG1vS1VOeVU3VmdqSTZ1Q3NRbXpjdGdhUjFWOGtFZjRmODI2T2tjU1NVN2Z3Z0Z4aXZhTGVUR0NndnZWCk54WU5aV2xJemZha1VrNzBMRVBEZ0cvdXR0NURqRnlRUm96WmN2NkJTKzRuZHV3ME9wYU5GZkFINHhhVW56Mk4KNktRc29aZ2Y5MXIrUXZoV1VHSEt6N2J3SHE2NnZ3SW45Ynl0d21hcjVOMVFwQ0FvWExlUmwxVGdhSytTQ0g0ZAp6TGpTcTVJMHhQNUVHaTRqN1pNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLdlhqWFJOS21wd0FMTVNCRk4zV2dRUlprU2sKUk9hd2ZOTjQxK2RRVGlvakNmL3dQcC8rdnFZR0MrcFRJSkNBK0IwNHFKL0hwMTU4bUR6U0p3MnhTeEVSRjBsNQpTZVYycktINkM1ZTc4ZEdCME9WQVB4bndEa0ljbzFlcW1xSlBqRWNmbnlKZ1F2aVdCYjhtMmpDNmFCSjE0Zm90CktyYmhEQlpja09qUXZ0WXBrelk1WEhvU1dwdXE2TkdvMUUwbW1PZktZY3NsdU5RTm1oRDRsbU9pTzAzSWI4RHkKeXJlTlFhRU1qTGxPdDVTZmxOT0NJRXlRS2VxZDRjeVlNMU1VUXFwQXFwN05UWlVrQmt2a0J6QzVWbXY4c0Q2UgpMaTlWZWtvT1NIN05MOGVyU3hMUy9BVzdXTm8vV0VMbXhFY0p5MXlHbXc4ZTRsKzFSV0xBdncwbkRIND0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=\n  name: eks_lead\n\ncontexts:\n- context:\n    cluster: eks_lead\n    user: eks_lead\n  name: eks_lead\n\ncurrent-context: eks_lead\n\nusers:\n- name: eks_lead\n  user:\n    exec:\n      apiVersion: client.authentication.k8s.io/v1alpha1\n      command: aws-iam-authenticator\n      args:\n        - \"token\"\n        - \"-i\"\n        - \"lead\"\n\n\n"
        } -> (known after apply) # forces replacement
    }

  # module.eks.random_pet.workers[0] must be replaced
+/- resource "random_pet" "workers" {
      ~ id        = "summary-hagfish" -> (known after apply)
      ~ keepers   = {
          - "lc_name" = "lead-essential02019103123570822260000001f"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

  # module.eks.random_pet.workers_launch_template[0] must be replaced
+/- resource "random_pet" "workers_launch_template" {
      ~ id        = "teaching-termite" -> (known after apply)
      ~ keepers   = {
          - "lt_name" = "lead-preemptible020191031235705337900000018-1"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

  # module.eks.random_pet.workers_launch_template[1] must be replaced
+/- resource "random_pet" "workers_launch_template" {
      ~ id        = "smooth-hedgehog" -> (known after apply)
      ~ keepers   = {
          - "lt_name" = "lead-preemptible12019103123570551910000001b-1"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

  # module.eks.random_pet.workers_launch_template[2] must be replaced
+/- resource "random_pet" "workers_launch_template" {
      ~ id        = "upright-redfish" -> (known after apply)
      ~ keepers   = {
          - "lt_name" = "lead-preemptible22019103123570576690000001d-1"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

  # module.sdm.helm_release.operator_toolchain[0] will be updated in-place
  ~ resource "helm_release" "operator_toolchain" {
        chart            = "operator-toolchain"
        disable_webhooks = false
        force_update     = false
        id               = "operator-toolchain"
        metadata         = [
            {
                chart     = "operator-toolchain"
                name      = "operator-toolchain"
                namespace = "toolchain"
                revision  = 10
                values    = "cluster: lead\ncluster_domain: lead.sandbox.liatr.io\noperators:\n  jenkins:\n    serviceAccountAnnotations:\n      eks.amazonaws.com/role-arn: arn:aws:iam::774051255656:role/lead_operator_jenkins_service_account\n  slack:\n    env:\n    - name: workspace_role\n      value: lead_workspace_role\n    - name: AWS_REGION\n      value: us-east-1\n    ingress:\n      annotations:\n        kubernetes.io/ingress.class: nginx\n        kubernetes.io/tls-acme: \"true\"\n      hostName: operator-slack.toolchain.lead.sandbox.liatr.io\n      tls:\n      - hosts:\n        - operator-slack.toolchain.lead.sandbox.liatr.io\n        secretName: operator-slack-ingress-tls\n    serviceAccountAnnotations:\n      eks.amazonaws.com/role-arn: arn:aws:iam::774051255656:role/lead_operator_slack_service_account\nproduct_stack: product-aws\nproduct_vars:\n  builder_images_version: v1.0.16-4-g07f4a2d\n  enable_keycloak: \"true\"\n  image_repo: artifactory.toolchain.lead.prod.liatr.io/docker-registry/flywheel\n  issuer_server: https://acme-staging-v02.api.letsencrypt.org/directory\n  issuer_type: acme\n  jenkins_image_version: v1.0.16-4-g07f4a2d\nproduct_version: 3fdf51a\n"
                version   = "v0.4.3-10-gbfc72a3"
            },
        ]
        name             = "operator-toolchain"
        namespace        = "toolchain"
        recreate_pods    = false
        repository       = "lead.prod.liatr.io"
        reuse            = false
        reuse_values     = false
        status           = "DEPLOYED"
        timeout          = 300
      ~ values           = [
          - "cluster: lead\ncluster_domain: lead.sandbox.liatr.io\nproduct_version: \"3fdf51a\"\nproduct_stack: product-aws\nproduct_vars: {\"builder_images_version\":\"v1.0.16-4-g07f4a2d\",\"enable_keycloak\":\"true\",\"image_repo\":\"artifactory.toolchain.lead.prod.liatr.io/docker-registry/flywheel\",\"issuer_server\":\"https://acme-staging-v02.api.letsencrypt.org/directory\",\"issuer_type\":\"acme\",\"jenkins_image_version\":\"v1.0.16-4-g07f4a2d\"}\n\noperators:\n  slack:\n    ingress:\n      hostName: operator-slack.toolchain.lead.sandbox.liatr.io\n      annotations:\n        kubernetes.io/ingress.class: \"nginx\"\n        kubernetes.io/tls-acme: \"true\"\n      tls:\n      - hosts:\n        - operator-slack.toolchain.lead.sandbox.liatr.io\n        secretName: operator-slack-ingress-tls\n    serviceAccountAnnotations: {\"eks.amazonaws.com/role-arn\":\"arn:aws:iam::774051255656:role/lead_operator_slack_service_account\"}\n    env:\n    - name: workspace_role\n      value: lead_workspace_role\n    - name: AWS_REGION\n      value: us-east-1\n  jenkins:\n    serviceAccountAnnotations: {\"eks.amazonaws.com/role-arn\":\"arn:aws:iam::774051255656:role/lead_operator_jenkins_service_account\"}\n",
          + "cluster: lead\ncluster_domain: lead.sandbox.liatr.io\nproduct_version: \"0c46b0d\"\nproduct_stack: product-aws\nproduct_vars: {\"builder_images_version\":\"v1.0.16-4-g07f4a2d\",\"enable_keycloak\":\"true\",\"image_repo\":\"artifactory.toolchain.lead.prod.liatr.io/docker-registry/flywheel\",\"issuer_server\":\"https://acme-staging-v02.api.letsencrypt.org/directory\",\"issuer_type\":\"acme\",\"jenkins_image_version\":\"v1.0.16-4-g07f4a2d\"}\n\noperators:\n  slack:\n    ingress:\n      hostName: operator-slack.toolchain.lead.sandbox.liatr.io\n      annotations:\n        kubernetes.io/ingress.class: \"nginx\"\n        kubernetes.io/tls-acme: \"true\"\n      tls:\n      - hosts:\n        - operator-slack.toolchain.lead.sandbox.liatr.io\n        secretName: operator-slack-ingress-tls\n    serviceAccountAnnotations: {\"eks.amazonaws.com/role-arn\":\"arn:aws:iam::774051255656:role/lead_operator_slack_service_account\"}\n    env:\n    - name: workspace_role\n      value: lead_workspace_role\n    - name: AWS_REGION\n      value: us-east-1\n  jenkins:\n    serviceAccountAnnotations: {\"eks.amazonaws.com/role-arn\":\"arn:aws:iam::774051255656:role/lead_operator_jenkins_service_account\"}\n",
        ]
        verify           = false
        version          = "v0.4.3-10-gbfc72a3"
        wait             = true
    }

  # module.toolchain.data.template_file.artifactory_security_values will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "artifactory_security_values"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "<?xml version='1.0' encoding='UTF-8'?>\n<security version=\"v10\">\n  <users>\n    <user>\n      <username>anonymous</username>\n      <admin>false</admin>\n      <enabled>true</enabled>\n      <updatableProfile>false</updatableProfile>\n      <accountNonExpired>true</accountNonExpired>\n      <credentialsExpired>false</credentialsExpired>\n      <credentialsNonExpired>true</credentialsNonExpired>\n      <accountNonLocked>true</accountNonLocked>\n      <realm>internal</realm>\n      <transientUser>false</transientUser>\n      <groups/>\n      <userPropertyInfos/>\n      <lastLoginTimeMillis>0</lastLoginTimeMillis>\n      <lastAccessTimeMillis>0</lastAccessTimeMillis>\n      <locked>false</locked>\n    </user>\n    <user>\n      <username>admin</username>\n      <password>${admin_bcrypt_pass}</password>\n      <admin>true</admin>\n      <enabled>true</enabled>\n      <updatableProfile>true</updatableProfile>\n      <accountNonExpired>true</accountNonExpired>\n      <credentialsExpired>false</credentialsExpired>\n      <credentialsNonExpired>true</credentialsNonExpired>\n      <accountNonLocked>true</accountNonLocked>\n      <realm>internal</realm>\n      <transientUser>false</transientUser>\n      <groups/>\n      <userPropertyInfos/>\n      <lastLoginTimeMillis>1559856264073</lastLoginTimeMillis>\n      <lastLoginClientIp>127.0.0.1</lastLoginClientIp>\n      <lastAccessTimeMillis>0</lastAccessTimeMillis>\n      <locked>false</locked>\n    </user>\n    <user>\n      <username>jenkins</username>\n      <password>${jenkins_bcrypt_pass}</password>\n      <email>jenkins@liatr.io</email>\n      <admin>false</admin>\n      <enabled>true</enabled>\n      <updatableProfile>true</updatableProfile>\n      <accountNonExpired>true</accountNonExpired>\n      <credentialsExpired>false</credentialsExpired>\n      <credentialsNonExpired>true</credentialsNonExpired>\n      <accountNonLocked>true</accountNonLocked>\n      <realm>internal</realm>\n      <transientUser>false</transientUser>\n      <groups>\n        <org.artifactory.model.xstream.security.UserGroupImpl>deployers</org.artifactory.model.xstream.security.UserGroupImpl>\n        <org.artifactory.model.xstream.security.UserGroupImpl>readers</org.artifactory.model.xstream.security.UserGroupImpl>\n      </groups>\n      <userPropertyInfos/>\n      <lastLoginTimeMillis>0</lastLoginTimeMillis>\n      <lastAccessTimeMillis>0</lastAccessTimeMillis>\n      <locked>false</locked>\n    </user>\n  </users>\n  <groups>\n    <group>\n      <groupName>deployers</groupName>\n      <newUserDefault>true</newUserDefault>\n      <realm>internal</realm>\n      <adminPrivileges>false</adminPrivileges>\n    </group>\n    <group>\n      <groupName>readers</groupName>\n      <description>A group for read-only users</description>\n      <newUserDefault>true</newUserDefault>\n      <realm>internal</realm>\n      <adminPrivileges>false</adminPrivileges>\n    </group>\n  </groups>\n  <acls>\n    <acl>\n      <aces>\n        <ace>\n          <principal>readers</principal>\n          <group>true</group>\n          <mask>1</mask>\n        </ace>\n        <ace>\n          <principal>anonymous</principal>\n          <group>false</group>\n          <mask>1</mask>\n        </ace>\n      </aces>\n      <updatedBy>_system_</updatedBy>\n      <lastUpdated>1559840733272</lastUpdated>\n      <accessIdentifier>jfrt@01dcpw0zxkn1mf1s69sj3j153g:fb672723-ae39-4681-8249-293bcc624826</accessIdentifier>\n      <permissionTarget>\n        <name>Anything</name>\n        <includes>\n          <string>**</string>\n        </includes>\n        <excludes/>\n        <repoKeys>\n          <string>ANY</string>\n        </repoKeys>\n      </permissionTarget>\n    </acl>\n    <acl>\n      <aces>\n        <ace>\n          <principal>deployers</principal>\n          <group>true</group>\n          <mask>15</mask>\n        </ace>\n      </aces>\n      <updatedBy>admin</updatedBy>\n      <lastUpdated>1559856898049</lastUpdated>\n      <accessIdentifier>jfrt@01dcpw0zxkn1mf1s69sj3j153g:10ff2e19-8125-47a1-a2de-3949ea5cb367</accessIdentifier>\n      <permissionTarget>\n        <name>DeployAny</name>\n        <includes>\n          <string>**</string>\n        </includes>\n        <excludes/>\n        <repoKeys>\n          <string>ANY LOCAL</string>\n          <string>ANY REMOTE</string>\n        </repoKeys>\n      </permissionTarget>\n    </acl>\n    <acl>\n      <aces>\n        <ace>\n          <principal>anonymous</principal>\n          <group>false</group>\n          <mask>3</mask>\n        </ace>\n      </aces>\n      <updatedBy>_system_</updatedBy>\n      <lastUpdated>1559840733667</lastUpdated>\n      <accessIdentifier>jfrt@01dcpw0zxkn1mf1s69sj3j153g:9ba5c95a-4167-43dc-bff9-eb9df1943743</accessIdentifier>\n      <permissionTarget>\n        <name>Any Remote</name>\n        <includes>\n          <string>**</string>\n        </includes>\n        <excludes/>\n        <repoKeys>\n          <string>ANY REMOTE</string>\n        </repoKeys>\n      </permissionTarget>\n    </acl>\n  </acls>\n  <buildAcls>\n    <buildAcl>\n      <aces>\n        <ace>\n          <principal>readers</principal>\n          <group>true</group>\n          <mask>1</mask>\n        </ace>\n        <ace>\n          <principal>anonymous</principal>\n          <group>false</group>\n          <mask>1</mask>\n        </ace>\n      </aces>\n      <updatedBy>_system_</updatedBy>\n      <lastUpdated>1559840733573</lastUpdated>\n      <accessIdentifier>jfrt@01dcpw0zxkn1mf1s69sj3j153g:18078810-6aa4-4af7-b6ab-3c8d5680197d</accessIdentifier>\n      <permissionTarget>\n        <name>Anything</name>\n        <includes>\n          <string>**</string>\n        </includes>\n        <excludes/>\n        <repoKeys>\n          <string>artifactory-build-info</string>\n        </repoKeys>\n      </permissionTarget>\n    </buildAcl>\n  </buildAcls>\n</security>\n"
      + vars     = {
          + "admin_bcrypt_pass"   = (known after apply)
          + "jenkins_bcrypt_pass" = (known after apply)
        }
    }

Plan: 12 to add, 6 to change, 13 to destroy.

```
</details>